In [1]:
import pandas as pd
import numpy as np
import re

In [57]:
data=pd.DataFrame({'name':['a123-32','b234/43','cx567/76','5879'],'value':[154,897,856,54]})
data

       name  value
0   a123-32    154
1   b234/43    897
2  cx567/76    856
3      5879     54

In [59]:
data['add']=data['name'][0]

In [60]:
data.eval('xx=value',inplace=True)
data.drop('xx',1,inplace=True)

In [61]:
data['name'].str.contains('[a-z]')

0     True
1     True
2     True
3    False
Name: name, dtype: bool

In [239]:
data[data['name'].str.contains('[a-z]')]

       name value      add
0   a123-32  1000  a123-32
1   b234/43   897  a123-32
2  cx567/76   856  a123-32

In [63]:
data['name'].str.contains('[3]').sum()

2

In [66]:
data['name'].str.contains('\d') ##co ky tu la so, tuong duong [0-9]

0    True
1    True
2    True
3    True
Name: name, dtype: bool

In [68]:
data['name'].str.contains('\D') #Khớp với các ký tự không phải số, tương đương với

0     True
1     True
2     True
3    False
Name: name, dtype: bool

In [74]:
data['name'].str.contains('[^0-9]').sum()

3

In [89]:
data['name'].str.contains('7.7')

0    False
1    False
2     True
3    False
Name: name, dtype: bool

In [136]:
data['name'].str.replace('[/-]',"*")

<ipython-input-136-e7fe7eba4732>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  data['name'].str.replace('[/-]',"*")

0     a123*32
1     b234*43
2    cx567*76
3        5879
Name: name, dtype: object

In [151]:
data['name'].str[1:]

0     123-32
1     234/43
2    x567/76
3        879
Name: name, dtype: object

In [180]:
data['value'][0]='a154'

<ipython-input-180-a2e424d0ddb8>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['value'][0]='a154'
C:\Users\nguye\anaconda3\lib\site-packages\pandas\core\indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [183]:
data['value'].str[:2]

0     a1
1    NaN
2    NaN
3    NaN
Name: value, dtype: object

In [206]:
data

       name value      add
0   a123-32  a154  a123-32
1   b234/43   897  a123-32
2  cx567/76   856  a123-32
3      5879    54  a123-32

In [219]:
data['value'][0]=1000

In [236]:
data.loc[data.name.str.isdigit(),['name','add']]

   name      add
3  5879  a123-32

In [242]:
data.name.notna()

0    True
1    True
2    True
3    True
Name: name, dtype: bool

In [254]:
data.rename(columns={'add':'x'},inplace=False)

       name value        x
0   a123-32  1000  a123-32
1   b234/43   897  a123-32
2  cx567/76   856  a123-32
3      5879    54  a123-32

In [253]:
data

       name value        x
0   a123-32  1000  a123-32
1   b234/43   897  a123-32
2  cx567/76   856  a123-32
3      5879    54  a123-32

In [255]:
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
  0 57935    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100 57935  100 57935    0     0  75338      0 --:--:-- --:--:-- --:--:-- 75338

In [256]:
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100   835  100   835    0     0   1643      0 --:--:-- --:--:-- --:--:--  1640
100   835  100   835    0     0   1640      0 --:--:-- --:--:-- --:--:--  1637

In [257]:
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100   872  100   872    0     0   1614      0 --:--:-- --:--:-- --:--:--  1614

In [263]:
pop = pd.read_csv('state-population.csv')
areas = pd.read_csv('state-areas.csv')
abbrevs = pd.read_csv('state-abbrevs.csv')

display(pop.head(), areas.head(), abbrevs.head())

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [266]:
merged = pd.merge(pop, abbrevs, how='outer',
                  left_on='state/region', right_on='abbreviation')
merged = merged.drop('abbreviation', 1) # drop duplicate info
merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [271]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [272]:
merged[merged['population'].isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [278]:
merged.loc[merged['state'].isnull(),'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [279]:
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [288]:
merged.query('year==2010')

     state/region     ages  year   population          state
2              AL  under18  2010    1130966.0        Alabama
3              AL    total  2010    4785570.0        Alabama
90             AK  under18  2010     187902.0         Alaska
91             AK    total  2010     713868.0         Alaska
100            AZ  under18  2010    1628563.0        Arizona
...           ...      ...   ...          ...            ...
2405           WY    total  2010     564222.0        Wyoming
2490           PR    total  2010    3721208.0    Puerto Rico
2491           PR  under18  2010     896945.0    Puerto Rico
2538          USA  under18  2010   74119556.0  United States
2539          USA    total  2010  309326295.0  United States

[106 rows x 5 columns]